Tekla.Structures.Analysis.Remoting.CDelegateSynchronized
The CDelegateSynchronized class provides akit synchronization to CAnalysisDelegate.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.#ctor
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.InvokeRequired
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.EndInvoke(System.IAsyncResult)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.Invoke(System.Delegate,System.Object[])
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.BeginInvoke(System.Delegate,System.Object[])
DO NOT USE! For internal usage only!
Method: The method used.
Args: The arguments used.
Returns: Returns an IAsyncResult on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportGetDotType(Tekla.Structures.AnalysisInternal.DotAnalysisObject@)
DO NOT USE! For internal usage only!
AnalysisObject: The analysis object.
Returns: Returns TRUE if successfully retrieved the dot type.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportEnumerateAnalysisObjects(Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator@)
DO NOT USE! For internal usage only!
Enumerator: The analysis enumerator.
Returns: Returns TRUE if successfully selected the analysis enumerator.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportInsertAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE if successfully inserted the analysis model.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE if successfully selected the analysis model.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE if successfully modified the analysis model.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportDeleteAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE if successfully deleted the analysis model.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportAnalysisModelObjectOperation(Tekla.Structures.Analysis.DotAnalysisModelObjectOperation@)
DO NOT USE! For internal usage only!
AnalysisModelObjectOperation: Model part operation.
Returns: Returns TRUE if model part operation is successful.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSetActiveAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: Analysis model.
Returns: Returns TRUE if set active analysis model is successful.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportGetActiveAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: Analysis model.
Returns: Returns TRUE if get active analysis model is successful.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportInsertAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!
AnalysisPart: The analysis part.
Returns: Returns TRUE if successfully inserted the analysis part.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!
AnalysisPart: The analysis part.
Returns: Returns TRUE if successfully selected the analysis part.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!
AnalysisPart: The analysis part.
Returns: Returns TRUE if successfully modified the analysis part.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportDeleteAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!
AnalysisPart: The analysis part.
Returns: Returns TRUE if successfully deleted the analysis part.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportInsertAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!
AnalysisNode: The analysis part.
Returns: Returns TRUE if successfully inserted the analysis part.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!
AnalysisNode: The analysis part.
Returns: Returns TRUE if successfully selected the analysis part.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!
AnalysisNode: The analysis part.
Returns: Returns TRUE if successfully modified the analysis part.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportDeleteAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!
AnalysisNode: The analysis part.
Returns: Returns TRUE if successfully deleted the analysis part.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportInsertAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!
AnalysisNodeLink: The analysis part.
Returns: Returns TRUE if successfully inserted the analysis part.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!
AnalysisNodeLink: The analysis part.
Returns: Returns TRUE if successfully selected the analysis part.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!
AnalysisNodeLink: The analysis part.
Returns: Returns TRUE if successfully modified the analysis part.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportDeleteAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!
AnalysisNodeLink: The analysis part.
Returns: Returns TRUE if successfully deleted the analysis part.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportInsertAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!
AnalysisBar: The analysis bar.
Returns: Returns TRUE if successfully inserted the analysis bar.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!
AnalysisBar: The analysis bar.
Returns: Returns TRUE if successfully selected the analysis bar.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!
AnalysisBar: The analysis bar.
Returns: Returns TRUE if successfully modified the analysis bar.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportDeleteAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!
AnalysisBar: The analysis bar.
Returns: Returns TRUE if successfully deleted the analysis bar.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportInsertAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!
AnalysisArea: The analysis area.
Returns: Returns TRUE if successfully inserted the analysis area.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!
AnalysisArea: The analysis area.
Returns: Returns TRUE if successfully selected the analysis area.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!
AnalysisArea: The analysis area.
Returns: Returns TRUE if successfully modifed the analysis area.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportDeleteAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!
AnalysisArea: The analysis area.
Returns: Returns TRUE if successfully delete the analysis area.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisVolume(Tekla.Structures.AnalysisInternal.DotAnalysisVolume@)
DO NOT USE! For internal usage only!
AnalysisVolume: The analysis volume.
Returns: Returns TRUE if successfully selected the analysis volume.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisMember(Tekla.Structures.AnalysisInternal.DotAnalysisMember@)
DO NOT USE! For internal usage only!
AnalysisMember: The analysis member.
Returns: Returns TRUE if successfully modified the analysis member.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisMember(Tekla.Structures.AnalysisInternal.DotAnalysisMember@)
DO NOT USE! For internal usage only!
AnalysisMember: The analysis member.
Returns: Returns TRUE if successfully selected the analysis member.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisDecomposedNodeLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedNodeLoad@)
DO NOT USE! For internal usage only!
AnalysisAnalysisDecomposedNodeLoad: The decomposed node load.
Returns: Returns TRUE if successfully selected the decomposed node load.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisDecomposedBarLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad@)
DO NOT USE! For internal usage only!
AnalysisAnalysisDecomposedBarLoad: The decomposed bar load.
Returns: Returns TRUE if successfully selected the decomposed bar load.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisDecomposedAreaLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad@)
DO NOT USE! For internal usage only!
AnalysisAnalysisDecomposedAreaLoad: The decomposed area load.
Returns: Returns TRUE if successfully selected the decomposed area load.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisDecomposedMemberLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedMemberLoad@)
DO NOT USE! For internal usage only!
AnalysisAnalysisDecomposedMemberLoad: The decomposed member load.
Returns: Returns TRUE if successfully selected the decomposed member load.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisDecomposedSelfweightLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedSelfweightLoad@)
DO NOT USE! For internal usage only!
AnalysisAnalysisDecomposedSelfweightLoad: The decomposed selfweight load.
Returns: Returns TRUE if successfully selected the decomposed selfweight load.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisDecomposedTemperatureLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedTemperatureLoad@)
DO NOT USE! For internal usage only!
AnalysisAnalysisDecomposedTemperatureLoad: The decomposed temperatureload.
Returns: Returns TRUE if successfully selected the decomposed temperatureload load.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisEdge(Tekla.Structures.AnalysisInternal.DotAnalysisEdge@)
DO NOT USE! For internal usage only!
AnalysisEdge: The analysis edge.
Returns: Returns TRUE if successfully modified the analysis edge.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisEdge(Tekla.Structures.AnalysisInternal.DotAnalysisEdge@)
DO NOT USE! For internal usage only!
AnalysisEdge: The analysis edge.
Returns: Returns TRUE if successfully selected the analysis edge.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportInsertAnalysisPosition(Tekla.Structures.AnalysisInternal.DotAnalysisPosition@)
DO NOT USE! For internal usage only!
AnalysisPosition: The analysis position.
Returns: Returns TRUE if successfully inserted the analysis poistion.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisPosition(Tekla.Structures.AnalysisInternal.DotAnalysisPosition@)
DO NOT USE! For internal usage only!
AnalysisPosition: The analysis position.
Returns: Returns TRUE if successfully selected the analysis poistion.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportMoveAnalysisPosition(Tekla.Structures.AnalysisInternal.DotAnalysisPositionMove@)
DO NOT USE! For internal usage only!
AnalysisPositionMove: The analysis position move.
Returns: Returns TRUE if successfully selected the analysis poistion.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisModelDesignProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties@)
DO NOT USE! For internal usage only!
AnalysisModelDesignProperties: The analysis model design properties.
Returns: Returns TRUE if successfully selected the analysis model design properties.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisModelDesignProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties@)
DO NOT USE! For internal usage only!
AnalysisModelDesignProperties: The analysis model design properties.
Returns: Returns TRUE if successfully modified the analysis model design properties.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisModelJobProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties@)
DO NOT USE! For internal usage only!
AnalysisModelJobProperties: The analysis model job properties.
Returns: Returns TRUE if successfully selected the analysis model job properties.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisModelJobProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties@)
DO NOT USE! For internal usage only!
AnalysisModelJobProperties: The analysis model job properties.
Returns: Returns TRUE if successfully modified the analysis model job properties.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisModelModalAnalysisProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties@)
DO NOT USE! For internal usage only!
AnalysisModelModalAnalysisProperties: The analysis model modal analysis properties.
Returns: Returns TRUE if successfully selected the analysis model modal analysis properties.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisModelModalAnalysisProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties@)
DO NOT USE! For internal usage only!
AnalysisModelModalAnalysisProperties: The analysis model modal analysis properties.
Returns: Returns TRUE if successfully modified the analysis model modal analysis properties.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisModelOutputProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties@)
DO NOT USE! For internal usage only!
AnalysisModelOutputProperties: The analysis model output properties.
Returns: Returns TRUE if successfully selected the analysis model output properties.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisModelOutputProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties@)
DO NOT USE! For internal usage only!
AnalysisModelOutputProperties: The analysis model output properties.
Returns: Returns TRUE if successfully modified the analysis model output properties.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisModelSeismicProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties@)
DO NOT USE! For internal usage only!
AnalysisModelSeismicProperties: The analysis model seismic properties.
Returns: Returns TRUE if successfully selected the analysis model seismic properties.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisModelSeismicProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties@)
DO NOT USE! For internal usage only!
AnalysisModelSeismicProperties: The analysis model seismic properties.
Returns: Returns TRUE if successfully modified the analysis model seismic properties.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisModelSpectrumProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties@)
DO NOT USE! For internal usage only!
AnalysisModelSpectrumProperties: The analysis model spectrum properties.
Returns: Returns TRUE if successfully selected the analysis model spectrum properties.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisModelSpectrumProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties@)
DO NOT USE! For internal usage only!
AnalysisModelSpectrumProperties: The analysis model spectrum properties.
Returns: Returns TRUE if successfully modified the analysis model spectrum properties.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisDesignParameter(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter@)
DO NOT USE! For internal usage only!
analysisDesignParameter: The analysis design parameter.
Returns: Returns TRUE if successfully selected the analysis design parameter.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisDesignParameter(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter@)
DO NOT USE! For internal usage only!
analysisDesignParameter: The analysis design parameter.
Returns: Returns TRUE if successfully modified the analysis design parameter.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisDesignParameterMulti(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti@)
DO NOT USE! For internal usage only!
analysisDesignParameter: The analysis design parameter.
Returns: Returns TRUE if successfully selected the analysis design parameter.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisDesignParameterMulti(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti@)
DO NOT USE! For internal usage only!
analysisDesignParameter: The analysis design parameter.
Returns: Returns TRUE if successfully modified the analysis design parameter.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisModelConnectivityRule(Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule@)
DO NOT USE! For internal usage only!
AnalysisModelConnectivityRule: The analysis model connectivity rule.
Returns: Returns TRUE if successfully selected the analysis connecivity rule.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisFace(Tekla.Structures.AnalysisInternal.DotAnalysisFace@)
DO NOT USE! For internal usage only!
AnalysisFace: The analysis model face.
Returns: Returns TRUE if successfully selected the analysis face.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisVolumeItem(Tekla.Structures.AnalysisInternal.DotAnalysisVolumeItem@)
DO NOT USE! For internal usage only!
AnalysisVolumeItem: The analysis model volume item.
Returns: Returns TRUE if successfully selected the analysis volume item.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportInsertAnalysisCrossSection(Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection@)
DO NOT USE! For internal usage only!
AnalysisCrossSection: The analysis model cross section.
Returns: Returns TRUE if successfully selected the analysis cross section.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportDeleteAnalysisCrossSection(Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection@)
DO NOT USE! For internal usage only!
AnalysisCrossSection: The analysis model cross section.
Returns: Returns TRUE if successfully selected the analysis cross section.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisCrossSection(Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection@)
DO NOT USE! For internal usage only!
AnalysisCrossSection: The analysis model cross section.
Returns: Returns TRUE if successfully selected the analysis cross section.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportInsertAnalysisSubSection(Tekla.Structures.AnalysisInternal.DotAnalysisSubSection@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t})
DO NOT USE! For internal usage only!
AnalysisSubSection: The analysis model sub section.
dotPoints: The points.
Returns: Returns TRUE if successfully selected the analysis sub section.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisSubSection(Tekla.Structures.AnalysisInternal.DotAnalysisSubSection@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@)
DO NOT USE! For internal usage only!
AnalysisSubSection: The analysis model sub section.
dotPoints: The points.
Returns: Returns TRUE if successfully selected the analysis sub section.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisMaterial(Tekla.Structures.AnalysisInternal.DotAnalysisMaterial@)
DO NOT USE! For internal usage only!
AnalysisMaterial: The analysis model material.
Returns: Returns TRUE if successfully selected the analysis material.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisRigidDiaphragm(Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE if successfully selected the analysis rigid diaphragm.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisLoadGroup(Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE if successfully selected the analysis load group.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportInsertAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE if successfully inserted the analysis load combination.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportSelectAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE if successfully selected the analysis load combination.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportModifyAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE if successfully modified the analysis load combination.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportDeleteAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE if successfully delete the analysis load combination.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportInsertAnalysisResult(Tekla.Structures.AnalysisInternal.dotADResultCase_t@,Tekla.Structures.AnalysisInternal.dotADResultValue_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportDeleteAnalysisResults(Tekla.Structures.AnalysisInternal.dotADResultCase_t@,Tekla.Structures.AnalysisInternal.dotADResultValue_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportGetAnalysisResults(Tekla.Structures.AnalysisInternal.dotADResultValue_t,System.Int32,System.Collections.Generic.List{Tekla.Structures.AnalysisInternal.dotADResultValue_t}@)
DO NOT USE! For internal usage only!
key: The key.
sort: Sort true/false.
dotResults: The results.
Returns: Returns TRUE if successfully selected the analysis sub section.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportGetAnalysisResultCase(Tekla.Structures.AnalysisInternal.dotADResultCase_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.ExportQueryAnalysisResult(Tekla.Structures.AnalysisInternal.dotADResultCase_t@,Tekla.Structures.AnalysisInternal.dotADResultValue_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportGetDotType(Tekla.Structures.AnalysisInternal.DotAnalysisObject@)
DO NOT USE! For internal usage only!
AnalysisObject: The analysis object.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportEnumeratorHandler(Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator@)
DO NOT USE! For internal usage only!
Enumerator: The analysis enumerator.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportInsertEnumeratorHandler(Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator@)
DO NOT USE! For internal usage only!
Enumerator: The analysis enumerator.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportInsertAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportDeleteAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportAnalysisModelObjectOperation(Tekla.Structures.Analysis.DotAnalysisModelObjectOperation@)
DO NOT USE! For internal usage only!
AnalysisModelObjectOperation: Model part operation.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSetActiveAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportGetActiveAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportInsertAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!
AnalysisPart: The analysis part.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!
AnalysisPart: The analysis part.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!
AnalysisPart: The analysis part.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportDeleteAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!
AnalysisPart: The analysis part.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportInsertAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!
AnalysisNode: The analysis part.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!
AnalysisNode: The analysis part.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!
AnalysisNode: The analysis part.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportDeleteAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!
AnalysisNode: The analysis part.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportInsertAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!
AnalysisNodeLink: The analysis part.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!
AnalysisNodeLink: The analysis part.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!
AnalysisNodeLink: The analysis part.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportDeleteAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!
AnalysisNodeLink: The analysis part.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportInsertAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!
AnalysisBar: The analysis bar.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!
AnalysisBar: The analysis bar.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!
AnalysisBar: The analysis bar.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportDeleteAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!
AnalysisBar: The analysis bar.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportInsertAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!
AnalysisArea: The analysis area.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!
AnalysisArea: The analysis area.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!
AnalysisArea: The analysis area.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportDeleteAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!
AnalysisArea: The analysis area.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisVolume(Tekla.Structures.AnalysisInternal.DotAnalysisVolume@)
DO NOT USE! For internal usage only!
AnalysisVolume: The analysis volume.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisMember(Tekla.Structures.AnalysisInternal.DotAnalysisMember@)
DO NOT USE! For internal usage only!
AnalysisMember: The analysis member.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisMember(Tekla.Structures.AnalysisInternal.DotAnalysisMember@)
DO NOT USE! For internal usage only!
AnalysisMember: The analysis member.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisDecomposedNodeLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedNodeLoad@)
DO NOT USE! For internal usage only!
AnalysisDecomposedNodeLoad: The decomposed node load.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisDecomposedBarLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad@)
DO NOT USE! For internal usage only!
AnalysisDecomposedBarLoad: The decomposed bar load.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisDecomposedAreaLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad@)
DO NOT USE! For internal usage only!
AnalysisDecomposedAreaLoad: The decomposed area load.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisDecomposedMemberLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedMemberLoad@)
DO NOT USE! For internal usage only!
AnalysisDecomposedMemberLoad: The decomposed member load.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisDecomposedSelfweightLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedSelfweightLoad@)
DO NOT USE! For internal usage only!
AnalysisDecomposedSelfweightLoad: The decomposed selfweight load.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisDecomposedTemperatureLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedTemperatureLoad@)
DO NOT USE! For internal usage only!
AnalysisDecomposedTemperatureLoad: The decomposed temperature load.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisEdge(Tekla.Structures.AnalysisInternal.DotAnalysisEdge@)
DO NOT USE! For internal usage only!
AnalysisEdge: The analysis edge.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisEdge(Tekla.Structures.AnalysisInternal.DotAnalysisEdge@)
DO NOT USE! For internal usage only!
AnalysisEdge: The analysis edge.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportInsertAnalysisPosition(Tekla.Structures.AnalysisInternal.DotAnalysisPosition@)
DO NOT USE! For internal usage only!
AnalysisPosition: The analysis position.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisPosition(Tekla.Structures.AnalysisInternal.DotAnalysisPosition@)
DO NOT USE! For internal usage only!
AnalysisPosition: The analysis position.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportMoveAnalysisPosition(Tekla.Structures.AnalysisInternal.DotAnalysisPositionMove@)
DO NOT USE! For internal usage only!
AnalysisPositionMove: The analysis position move.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisModelDesignProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties@)
DO NOT USE! For internal usage only!
AnalysisModelDesignProperties: The analysis model design properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisModelDesignProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties@)
DO NOT USE! For internal usage only!
AnalysisModelDesignProperties: The analysis model design properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisModelJobProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties@)
DO NOT USE! For internal usage only!
AnalysisModelJobProperties: The analysis model job properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisModelJobProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties@)
DO NOT USE! For internal usage only!
AnalysisModelJobProperties: The analysis model job properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisModelModalAnalysisProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties@)
DO NOT USE! For internal usage only!
AnalysisModelModalAnalysisProperties: The analysis model modal analysis properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisModelModalAnalysisProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties@)
DO NOT USE! For internal usage only!
AnalysisModelModalAnalysisProperties: The analysis model modal analysis properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisModelOutputProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties@)
DO NOT USE! For internal usage only!
AnalysisModelOutputProperties: The analysis model output properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisModelOutputProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties@)
DO NOT USE! For internal usage only!
AnalysisModelOutputProperties: The analysis model output properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisModelSeismicProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties@)
DO NOT USE! For internal usage only!
AnalysisModelSeismicProperties: The analysis model seismic properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisModelSeismicProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties@)
DO NOT USE! For internal usage only!
AnalysisModelSeismicProperties: The analysis model seismic properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisModelSpectrumProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties@)
DO NOT USE! For internal usage only!
AnalysisModelSpectrumProperties: The analysis model Spectrum properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisModelSpectrumProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties@)
DO NOT USE! For internal usage only!
AnalysisModelSpectrumProperties: The analysis model Spectrum properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisDesignParameter(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter@)
DO NOT USE! For internal usage only!
analysisDesignParameter: The analysis design parameter properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisDesignParameter(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter@)
DO NOT USE! For internal usage only!
AnalysisDesignParameter: The analysis design parameter properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisDesignParameterMulti(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti@)
DO NOT USE! For internal usage only!
analysisDesignParameter: The analysis design parameter properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisDesignParameterMulti(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti@)
DO NOT USE! For internal usage only!
analysisDesignParameter: The analysis design parameter properties.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisModelConnectivityRule(Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule@)
DO NOT USE! For internal usage only!
AnalysisModelConnectivityRule: The analysis model connectivity rule.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisFace(Tekla.Structures.AnalysisInternal.DotAnalysisFace@)
DO NOT USE! For internal usage only!
AnalysisFace: The analysis face.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisVolumeItem(Tekla.Structures.AnalysisInternal.DotAnalysisVolumeItem@)
DO NOT USE! For internal usage only!
AnalysisVolumeItem: The analysis VolumeItem.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportInsertAnalysisCrossSection(Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection@)
DO NOT USE! For internal usage only!
AnalysisCrossSection: The analysis cross section.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportDeleteAnalysisCrossSection(Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection@)
DO NOT USE! For internal usage only!
AnalysisCrossSection: The analysis cross section.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisCrossSection(Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection@)
DO NOT USE! For internal usage only!
AnalysisCrossSection: The analysis cross section.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportInsertAnalysisSubSection(Tekla.Structures.AnalysisInternal.DotAnalysisSubSection@,Tekla.Structures.Internal.dotPoint_t*,System.Int32)
DO NOT USE! For internal usage only!
AnalysisSubSection: The analysis sub section.
pPoints: The points.
nPoints: The point count.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisSubSection(Tekla.Structures.AnalysisInternal.DotAnalysisSubSection@,Tekla.Structures.Internal.dotPoint_t*@,System.Int32@)
DO NOT USE! For internal usage only!
AnalysisSubSection: The analysis sub section.
ppPoints: The points.
pnPoints: The point count.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisMaterial(Tekla.Structures.AnalysisInternal.DotAnalysisMaterial@)
DO NOT USE! For internal usage only!
AnalysisMaterial: The analysis material.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisRigidDiaphragm(Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisLoadGroup(Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportInsertAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportSelectAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportModifyAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotAnalysisExportDeleteAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotExportInsertAnalysisResult(Tekla.Structures.AnalysisInternal.dotADResultCase_t@,Tekla.Structures.AnalysisInternal.dotADResultValue_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotExportDeleteAnalysisResults(Tekla.Structures.AnalysisInternal.dotADResultCase_t@,Tekla.Structures.AnalysisInternal.dotADResultValue_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotExportGetAnalysisResults(Tekla.Structures.AnalysisInternal.dotADResultValue_t,System.Int32,Tekla.Structures.AnalysisInternal.dotADResultValue_t*@,System.Int32@)
DO NOT USE! For internal usage only!
key: The key.
sort: Sort true/false.
ppResults: The results.
pnResults: The result count.
Returns: Returns TRUE on success.

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotExportGetAnalysisResultCase(Tekla.Structures.AnalysisInternal.dotADResultCase_t@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateSynchronized.DotExportQueryAnalysisResult(Tekla.Structures.AnalysisInternal.dotADResultCase_t@,Tekla.Structures.AnalysisInternal.dotADResultValue_t@)
DO NOT USE! For internal usage only!